# -*- coding: utf-8 -*-
"""
Created on Sun Apr 24 2019

@author: Culincu Diana Cristina
"""

hiragana_list = ( 	'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ', 'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま', 'み', 'む', 'め', 'も', 'ら', 'り', 'る', 'れ', 'ろ', 'や', 'よ', 'ゆ', 'わ', 'を', 'ん', 
					'が', 'ぎ', 'ぐ', 'げ', 'ご', 'ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'だ', 'ぢ', 'づ', 'で', 'ど', 'ば', 'び', 'ぶ', 'べ', 'ぼ', 
					'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',  
					'きゃ', 'きゅ','きょ', 'しゃ', 'しゅ', 'しょ', 'ちゃ', 'ちゅ', 'ちょ', 'にゃ', 'にゅ', 'にょ', 'ひゃ', 'ひゅ', 'ひょ', 'みゃ', 'みゅ', 'みょ', 'りゃ', 'りゅ', 'りょ', 'ぎゃ', 'ぎゅ', 'ぎょ', 'じゃ', 'じゅ', 'じょ', 'びゃ', 'びゅ', 'びょ', 'ぴゃ', 'ぴゅ', 'ぴょ' 
				)					
					
					
					
hiragana_gojuon = {
        
            'あ' :   'a'		,
            'い' :   'i' 	,
            'う'	:  	'u' 	,
            'え' :  	'e' 	,
            'お' :  	'o' 	,
            'か' :  	'ka'	, 
            'き' :  	'ki'	,
            'く'	:  	'ku'	,
            'け' :  	'ke'	,
            'こ' :  	'ko'	,
            'さ' :  	'sa'	,
            'し' :  	'shi'   ,
            'す' :  	'su'  	,
            'せ' :  	'se'  	,
            'そ' :  	'so'  	, 
            'た' :  	'ta'  	, 
            'ち' :  	'chi' 	, 
            'つ' :  	'tsu' 	,
            'て' :  	'te'  	,
            'と' :  	'to'  	,
            'な' :  'na'  	,
            'に' :  'ni'  	,
            'ぬ' :  'nu'  	,
            'ね' :  'ne'  	,
            'の' :  'no'  	,
            'は' :  'ha'  	,
            'ひ' :  'hi'  	,
            'ふ' :  'fu'  	,
            'へ' :  'he'  	,
            'ほ' :  'ho'  	,
            'ま' :  'ma'  	,
            'み' :  'mi'  	,
            'む' :  'mu'  	,
            'め' :  'me'  	,
            'も' :  'mo'  	,
            'ら' :  'ra'  	,
            'り' :  'ri'  	,
            'る' :  'ru'  	,
            'れ' :  're'  	,
            'ろ' :  'ro'  	,
            'や' :  'ya'  	,
            'よ' :  'yo'  	,
            'ゆ' :  'yu'  	, 
            'わ' :  'wa'  	,
            'を' :  'wo'  	,
            'ん' :  'n'  	
                
}

hiragana_dakuon = {
                'が'	:	'ga'  ,
                'ぎ'	:	'gi'  ,
                'ぐ'	:	'gu'  ,
                'げ'	:	'ge'  ,
                'ご'	:	'go'  ,
                'ざ'	:	'za'  ,
                'じ'	:	'ji'  ,
                'ず'	:	'zu'  ,
                'ぜ'	:	'ze'  ,
                'ぞ'	:	'zo'  ,
                'だ'	:	'da'  ,
                'ぢ'	:	'ji'  ,
                'づ'	:	'zu'  ,
                'で'	:	'de'  ,
                'ど'	:	'do'  ,
                'ば'	:	'ba'  ,
                'び'	:	'bi'  ,
                'ぶ'	:	'bu'  ,
                'べ'	:	'be'  ,
                'ぼ'	:	'bo'  

}

hiragana_handakuon = {
                'ぱ'	:	'pa'  ,
                'ぴ'	:	'pi'  ,
                'ぷ'	:	'pu'  ,
                'ぺ'	:	'pe'  ,
                'ぽ'	:	'po'  
        
}

hiragana_yoon = {
                'きゃ'	:	'kya'  ,
                'きゅ'	:	'kyu'  ,
                'きょ'	:	'kyo'  ,
                'しゃ'	:	'sha'  ,
                'しゅ'	:	'shu'  ,
                'しょ'	:	'sho'  ,
                'ちゃ'	:	'cha'  ,
                'ちゅ'	:	'chu'  ,
                'ちょ'	:	'cho'  ,
                'にゃ'	:	'nya'  ,
                'にゅ'	:	'nyu'  ,
                'にょ'	:	'nyo'  ,
                'ひゃ'	:	'hya'  ,
                'ひゅ'	:	'hyu'  ,
                'ひょ'	:	'hyo'  ,
                'みゃ'	:	'mya'  ,
                'みゅ'	:	'myu'  ,
                'みょ'	:	'myo'  ,
                'りゃ'	:	'rya'  ,
                'りゅ'	:	'ryu'  ,
                'りょ'	:	'ryo'  ,
                'ぎゃ'	:	'gya'  ,
                'ぎゅ'	:	'gyu'  ,
                'ぎょ'	:	'gyo'  ,
                'じゃ'	:	'ja'   ,
                'じゅ'	:	'ju'   ,
                'じょ'	:	'jo'   ,
                'びゃ'	:	'bya'  ,
                'びゅ'	:	'byu'  ,
                'びょ'	:	'byo'  ,
                'ぴゃ'	:	'pya'  ,
                'ぴゅ'	:	'pyu'  ,
                'ぴょ'	:	'pyo'  
                
}

#print (hiragana_gojuon)
#print (hiragana_dakuon)
#print (hiragana_handakuon)
#print (hiragana_yoon)